"""
    存储全国各个城市的景区与美食,在控制台中显示出来
    北京:
        景区：故宫,天安门,天坛
        美食：烤鸭,炸酱面,豆汁,卤煮
    四川:
        九寨沟,峨眉山,春熙路
        美食：火锅,串串香,兔头
"""
dict01 = {
    "北京":
    {
        "景区": ["故宫", "天安门", "天坛"],
        "美食": ["烤鸭", "炸酱面", "豆汁", "卤煮"]
    },
    "四川":
    {
        "景区":["九寨沟", "峨眉山", "春熙路"],
        "美食":["火锅", "串串香", "兔头"]
    }
}
# 需求:获取四川的所有美食
print(dict01["四川"]["美食"])
# 需求：所有城市
for city in dict01:
    print(city)
# 所有城市的景区
list02 = []
# 遍历大字典获取的是地区
for city in dict01:
    # 遍历景区列表
    for item in dict01[city]["景区"]:
        # 地区 + 景区
        list02.append("{}:{}".format(city, item))
print(list02)