"""
    day09   复习
    购物车,体会重构
    2048算法,体会降维思想,锻炼逻辑思维
    面向对象
        概述：
            面向过程：关注过程(细节)   "干"
                例如，购物车
                选择菜单-->购买-->打印商品信息-->创建订单-->结算-->...
            面向对象：关心解决问题的人   "找"
                对象
        类与对象：
            类：class
            手机  键盘  茶杯  遥控器
            对象:个体
            类与类区别：行为(函数/方法)不同
            对象与对象的区别：数据不同
        语法：
            创建类:
                class 类别：
                    def __init__(self,参数):
                        # 数据成员
                        self.数据1 = 参数
                    # 行为成员
                    def 方法名称():
                        方法体
            创建对象:
                变量名 = 类名(参数)
"""
