"""
    day03 复习
    语句
        选择语句
            if bool类型的条件:
                满足条件执行的语句
            else:
                不满足条件执行的语句


            if 条件1:
                满足条件1执行的语句

            if 条件2：
                满足条件2执行的语句

            if 条件3：
                满足条件3执行的语句


            if 条件1:
                满足条件1执行的语句
            elif 条件2：
                不满足条件1,满足条件2执行的语句
            elif 条件3：
                不满足条件1和条件2,满足条件3执行的语句
            else:
                以上条件都不满足执行的语句
        循环语句
            if 条件：
                满足条件执行一次
            else:
                不满足条件执行一次

            while 条件：
                满足条件一直执行
            else:
                不满足条件执行一次
        跳转语句
            break

"""